# Table Construction

In [ ]:
-Create title table
CREATE TABLE titles (
    title_id VARCHAR (15) NOT NULL PRIMARY KEY,
    title VARCHAR (45) NOT NULL
);

select * FROM titles;

-Create employees table
CREATE TABLE employees (
    emp_no integer NOT NULL PRIMARY KEY,
    emp_title_id character varying(15) NOT NULL,
    FOREIGN KEY (emp_title_id) REFERENCES titles(title_id),
    birth_date timestamp without time zone NOT NULL,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    sex VARCHAR(10),
    hire_date timestamp without time zone NOT NULL
);

select * FROM employees;

-Create department employees table
CREATE TABLE dept_emp (
    emp_no integer NOT NULL,
	FOREIGN KEY (emp_no) REFERENCES employees(emp_no),
    dept_no VARCHAR (15) NOT NULL,
	FOREIGN KEY (dept_no) REFERENCES department(dept_no),
	PRIMARY KEY (emp_no, dept_no)
);

select * FROM dept_emp;
DROP TABLE dept_emp;

-Create department table
CREATE TABLE department (
  dept_no VARCHAR (15) NOT NULL PRIMARY KEY,
  dept_name VARCHAR (45) NOT NULL
);

select * FROM department;

-Create department manager table
CREATE TABLE dept_manager (
    dept_no VARCHAR(15) NOT NULL,
	FOREIGN KEY (dept_no) REFERENCES department(dept_no),
    emp_no integer NOT NULL,
	FOREIGN KEY (emp_no) REFERENCES employees(emp_no),
	PRIMARY KEY (dept_no, emp_no)
);

select * FROM dept_manager;

-Create salaries table
CREATE TABLE salaries (
    emp_no integer NOT NULL PRIMARY KEY,
    FOREIGN KEY (emp_no) REFERENCES employees(emp_no),
    salary integer NOT NULL
);

select * FROM salaries;

# Importing Tables

In [ ]:
COPY titles FROM '/Users/jenniferrocha/Public/EmployeeSQL/titles.csv' DELIMITER ',' CSV HEADER;
COPY employees FROM '/Users/jenniferrocha/Public/EmployeeSQL/employees.csv' DELIMITER ',' CSV HEADER;
COPY department FROM '/Users/jenniferrocha/Public/EmployeeSQL/departments.csv' DELIMITER ',' CSV HEADER;
COPY dept_emp FROM '/Users/jenniferrocha/Public/EmployeeSQL/dept_emp.csv' DELIMITER ',' CSV HEADER;
COPY dept_manager FROM '/Users/jenniferrocha/Public/EmployeeSQL/dept_manager.csv' DELIMITER ',' CSV HEADER;
COPY salaries FROM '/Users/jenniferrocha/Public/EmployeeSQL/salaries.csv' DELIMITER ',' CSV HEADER;

# Queries

In [ ]:
#employee number, last name, first name, sex, and salary.

SELECT ee.emp_no, ee.last_name, ee.first_name, ee.sex, s.salary
FROM employees ee
JOIN salaries s
ON (ee.emp_no = s.emp_no)

In [ ]:
#employees who were hired in 1986.

Select * FROM employees
WHERE hire_date BETWEEN '1986-01-01' AND '1986-12-31';

In [ ]:
#manager of each department with the following information: 
#department number, department name, the manager’s employee number, 
#last name, first name.
    
SELECT dm.dept_no, d.dept_name, dm.emp_no, ee.last_name, ee.first_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no)
        JOIN dept_manager dm
        ON (ee.emp_no = dm.emp_no);

In [ ]:
#department of each employee with the following information: 
#employee number, last name, first name, and department name.

SELECT ee.emp_no, ee.last_name, ee.first_name, d.dept_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no);

In [ ]:
#first name, last name, and sex for employees whose first name 
#is “Hercules” and last names begin with “B.”

SELECT first_name, last_name, sex
FROM employees ee
WHERE first_name = 'Hercules' AND last_name LIKE 'B%';

In [ ]:
#employees in the Sales department, including their employee number, 
#last name, first name, and department name.

SELECT ee.emp_no, ee.last_name, ee.first_name, d.dept_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no)
    WHERE d.dept_name = 'Sales';

In [ ]:
#all employees in the Sales and Development departments, including 
#their employee number, last name, first name, and department name.

SELECT ee.emp_no, ee.last_name, ee.first_name, d.dept_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no)
    WHERE d.dept_name = 'Sales' OR d.dept_name = 'Development';

In [ ]:
#descending order, list the frequency count of employee last names, i.e., 
#how many employees share each last name.

SELECT last_name, COUNT(last_name) AS "Last Names"
FROM employees
GROUP BY last_name
ORDER BY "Last Names" DESC;

## For Building the Tables to View in QuickDBD

In [ ]:
# For viewing table layout in QuickDBD 
employees as ee
-
emp_no PK
emp_title_id FK - titles.title_id
birth_date
first_name
last_name
sex
hire_date

dep_emp as de
-
de_key PK
emp_no FK -< ee.emp_no
dept_no FK - dept.dept_no

department as dept
-
dept_no PK
dept_name

dept_manager as dept_mgr
-
dm_key PK 
dept_no FK - dept.dept_no
emp_no FK -< ee.emp_no

salaries as sal
-
emp_no PK FK -< ee.emp_no
salary

titles as t
-
title_id PK
title

## Resource Used

https://stackoverflow.com/questions/9186741/sql-query-where-dates-year-is-year

# Start of Bonus

In [1]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:postgres@localhost:5432/Employee_DB')
conn = engine.connect()

### Import DB Tables as DataFrames

In [8]:
# Query All Records in the the Databases
salaries_df = pd.read_sql("SELECT * FROM salaries", conn)
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [9]:
titles_df = pd.read_sql("SELECT * FROM titles", conn)
titles_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [11]:
ee_df = pd.read_sql("SELECT * FROM employees", conn)
ee_df.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

### Merge DFs

In [13]:
ee_sal = ee_df.merge(salaries_df, on= "emp_no")
ee_sal

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000
...,...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28,69696
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26,75355
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24,61886
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08,62772
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23,41708

In [16]:
ee_title_sal = ee_sal.merge(titles_df, left_on = "emp_title_id", right_on= "title_id")
ee_title_sal

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,title_id,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,s0001,Staff
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,s0001,Staff
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,56087,s0001,Staff
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,87084,s0001,Staff
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,63016,s0001,Staff
...,...,...,...,...,...,...,...,...,...,...
300019,111400,m0001,1959-11-09,Arie,Staelin,M,1985-01-01,72446,m0001,Manager
300020,111133,m0001,1955-03-16,Hauke,Zhang,M,1986-12-30,71148,m0001,Manager
300021,110085,m0001,1959-10-28,Ebru,Alpin,M,1985-01-01,60026,m0001,Manager
300022,110386,m0001,1953-10-04,Shem,Kieras,M,1988-10-14,40000,m0001,Manager
300023,111784,m0001,1956-06-14,Marjo,Giarratana,F,1988-02-12,40000,m0001,Manager

### Select Salary and Title Only

In [18]:
title_sal_df = ee_title_sal.loc[:,["title", "salary"]]
title_sal_df

          title  salary
0         Staff   40000
1         Staff   40000
2         Staff   56087
3         Staff   87084
4         Staff   63016
...         ...     ...
300019  Manager   72446
300020  Manager   71148
300021  Manager   60026
300022  Manager   40000
300023  Manager   40000

[300024 rows x 2 columns]

### Math Stuffs

In [19]:
title_sal_df.groupby("title")["salary"].mean().round(2)

title
Assistant Engineer    48564.43
Engineer              48535.34
Manager               51531.04
Senior Engineer       48506.80
Senior Staff          58550.17
Staff                 58465.38
Technique Leader      48582.90
Name: salary, dtype: float64

### Graphs